import { Link } from "react-router-dom";
import "./Choose.css";
import { Footer, Nav } from "../../Containers";

const Choose = () => {
  return (
    <>
      <Nav />
      <div className="choose">
        <div className="main-title">
          <h2>اختر نمط اللعب</h2>
          <p>وفرنا لك العديد من الأنماط لتستمتع بتجربة رائعة</p>
        </div>
        <div className="container">
          <Link to="/1v1">
            <img src="assets/versus.png" alt="العب مع صديق" />
            <h3>العب مع صديق</h3>
            <p>
              وفرنا لك العديد من الأنماط لتستمتع بتجربة رائعة وفرنا لك العديد من
              الأنماط لتستمتع بتجربة رائعة وفرنا لك العديد من الأنماط لتستمتع
              بتجربة رائعة وفرنا لك العديد من الأنماط لتستمتع بتجربة رائعة
            </p>
          </Link>
          <Link to="/ai">
            <img src="assets/processor.png" alt="العب ضد الذكاء الاصطناعي" />
            <h3>العب ضد الذكاء الاصطناعي</h3>
            <p>
              وفرنا لك العديد من الأنماط لتستمتع بتجربة رائعة وفرنا لك العديد من
              الأنماط لتستمتع بتجربة رائعة وفرنا لك العديد من الأنماط لتستمتع
              بتجربة رائعة وفرنا لك العديد من الأنماط لتستمتع بتجربة رائعة
            </p>
          </Link>
          <Link to="">
            <img src="assets/computer.png" alt="العب ضد شخص" />
            <h3>العب ضد شخص</h3>
            <p>
              وفرنا لك العديد من الأنماط لتستمتع بتجربة رائعة وفرنا لك العديد من
              الأنماط لتستمتع بتجربة رائعة وفرنا لك العديد من الأنماط لتستمتع
              بتجربة رائعة وفرنا لك العديد من الأنماط لتستمتع بتجربة رائعة
            </p>
          </Link>
        </div>
      </div>
      <Footer />
    </>
  );
};

export default Choose;
